Repository: atlas-studios/Session2-G2
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 枫影的剑已经到了离沈萤不到半米的地方，突然觉得一股电流窜入全身，双膝一软直接趴答一下趴跪了下去，头咚的一声嗑在了旁边的石子堆里。
en_us: Feng Ying's sword was already within half a metre of Shen Ying. He suddenly felt a gush of electricity gushing through his entire body, both knees went soft and he fell into a kneel as his head plopped onto the stone stack at the side and kowtowed.

source: 枫影皱了皱，“你这想法我也有过，但三青界之间非化神不能自由往来，我人在上青界，对其它两界消息自然无法第一时间……”
en_us: Feng Ying furrowed his brows, "I also had this thought before, but those who are not Soul Formation in the three realms cannot move around freely, I am in the Upper Azure World, it is difficult for me to get first hand news of the other two realms..."

source: 枫影脸色一冷，更生气了，“少给我装蒜！三天前，不就是你们那个叫羿清的掌门，趁本楼主不在带人闯入我追魂楼，还借着找人的名义，打伤了我一百多位楼里的兄弟。你们堂堂隐世仙门，伤了人难道还不敢认账吗？”
en_us: Feng Ying's expression turned cold as he became angrier. "Stop acting dumb! Your Sect Master Yi Qing come to our Soul Chasing Tower three days ago claiming to look for someone, then injured over a hundred of my brothers while I wasn't there. Yours is a hidden immortal sect, yet you daren't own up to hitting people?"

source: 枫影脸色一白，转头诧异的看向众人。沈萤不会真不在这里吧，所以她们才不让他进去叫人？
en_us: Feng Ying's face drained of color. He turned toward the group of people in shock. Shen Ying isn't really gone, right? Is that why the girls refused to let him go and call her?

source: 枫影觉得自从来到无敌派后，这系统八成是疯了。什么叫独自守护门派？他要有这个本事，刚刚用得着布下迷魂阵逃回来吗？
en_us: Ever since Feng Ying arrived at the Invincible Sect, the system had been acting up 80% of the time. What did it mean when it told Feng Ying to defend the sect by himself? If he had the capabilities, would he have had to set up the Soul Confundus Array earlier?

source: 枫影：“……”
en_us: Feng Ying: "..."

source: 枫影：“……”卖主也卖得太快了吧。
en_us: Feng Ying: "..." The system is so quick to market its owner.

source: 某人茫然的看了看四周完全陌生的景色，后知后觉的想起个重要问题。
en_us: Shen Ying studied her strange surroundings and suddenly recalled an important question.

source: 某厨秒懂，低声提醒，“羿清。”
en_us: A certain chef immediately got her meaning and whispered a reminder, "Yi Qing."

source: 某狐一口老血喷涌而出，嘴边动了动硬是没挤出一个字来，下一刻头一歪彻底的没声息，活活憋死了。
en_us: The fox spewed a mouthful of blood. His mouth twitched but not a single word came out, and after a moment, his head dropped to the side and he breathed no more — he had suffocated himself to death.

source: 查探到丹田内储存下来的十缕黑色元力只剩下一缕了，江逸摇头叹气起来，这陪练活儿看来不适合他啊。要是那翊小姐再坚持一会，等他黑色元力消耗干净，他就原形毕露等着挨揍了……
en_us: Checking the ten wisps of black essence force in his dantian and realizing that he only had one wisp left, Jiang Yi shook his head and sighed. It seemed like this sparring partner job was not suited for him. If that Young Mistress Yi persevered for a little longer, and if his black essence force was fully consumed, his original condition would be fully revealed and he would have to endure getting beaten up...

source: 柳河长相比起黑旗要差上一些，不过肩宽腰细，体态完美，他也不是傻子，淡然一笑道：“听雨小姐，明天见！”
en_us: Liu He was slightly inferior to Heiqi in terms of looks. However, with broad shoulders and a slim waist, his figure was the epitome of perfection. He was no fool either, and bid his goodbye with a light smile, "Young Mistress Tingyu, I'll see you tomorrow!"

source: 柳长老一看之下，脸色更加暴怒了几分，目光如刀子般在江逸脸上扫过，手上红色元力滚滚而出，就要一掌朝江逸拍下。
en_us: Upon looking into the cauldron, Elder Liu's wrath grew further. His gaze cut across Jiang Yi's face like a knife as the red essence force on his hand rolled. He was getting ready to hit Jiang Yi with one slap.

source: 柳长老不炼丹了，他可就没废丹了，也就不能炼制丹药卖钱了，凭他自己要想炼制丹药，那根本是不可能的事。
en_us: If Elder Liu stopped refining elixirs, he would not have any more rejected elixirs. This meant that he would no longer have any more refined elixirs to sell. It was an impossibility to even think of relying on himself alone to produce elixirs.

source: 柳长老不知道昨日那两枚地阶丹药是江逸注入了两缕黑色元力，以为是不小心添加了其他的药剂，让原本的丹方改变，错打错着炼出了地阶丹药。
en_us: Elder Liu did not know that the two Earth-tier elixir pills he got yesterday were created when Jiang Yi injected two wisps of essence force. Instead, he assumed that he had accidentally added other medicinal ingredients and changed the original elixir formula, wrongly and unintentionally refining an Earth-tier elixir.

source: 柳长老也被江逸惊醒，目光一扫，微微颔首道：“不错，比江松那个废物勤奋多了，对了……你叫什么来着？”
en_us: Elder Liu was similarly surprised by Jiang Yi. He glanced around the room before slightly nodding and saying, "Not bad, you're much more hardworking than that useless good-for-nothing Jiang Song. Right... What did you say your name was?"

source: 柳长老今天炼制的丹药还是昨日的灵神丹配方，不过每次都加了一种药剂，结果不用说——自然所有丹都废掉了，完全不是人阶上品修炼所用的灵神丹，更不可能是地阶丹药。
en_us: The elixir Elder Liu was refining today was based on the formula for Spirit Pills used the day before. However, every time he refined he added in a different additional medicinal ingredient. The conclusions need not be stated in deep detail - naturally, all the elixirs turned out to be useless, not at all the Man-tier superior-grade spirit pills that were supposed to be refined, to say nothing of them possibly being Earth-tier elixirs.

source: 柳长老刚才无视江逸，此刻等他一走倒是扭头过来，暗暗点头喃喃一句，继续配置药粉。
en_us: Elder Liu had ignored Jiang Yi earlier, but once Jiang Yi had left, he turned his head and silently nodded, before continuing to configure his elixir formula.

source: 柳长老完全无视江逸了，他一双牛眼瞪得滚圆，抓起丹炉内的两枚黑色丹药，满脸都是惊疑：“灵神丹不是白色的吗？这两枚怎么变成黑色的了？好像……药力增强了？”
en_us: Elder Liu completely ignored Jiang Yi. His eyes were wide as a full moon as he grabbed the two black pills from the cauldron, his face filled with shock and confusion as he said, "Isn't the Spirit Pill white in color? How did these two become black? And it seems like... their medicinal efficacy has increased in power!"

source: 柳长老已经死去了三天了，江逸每天都躲在自家后院修炼，让江小奴在前院守着。他内心有种深深的担忧，现在不在炼丹房做事了，家族很有可能会安排新的杂活给他，而荣管事也很有可能上门，取回西山药田令牌。
en_us: Elder Liu had been dead for three days. For all of the three days, Jiang Yi hid at home and cultivated his power in his backyard while letting Jiang Xiaonu keep watch in the front courtyard. He had a sense of concern deep in his heart. Now that he no longer worked at the alchemy lab, the family clan would very likely arrange odd jobs for him to work on; and Chief Rong would very likely come to his house and retrieve the command token for the Western Hills herb plantation.

source: 柳长老怒了，横眉竖眼骂道：“混账东西，这有什么难的，这炉丹药已经差不多好了，你只需朝这里注入元力，等丹药凝固成型就行，快滚过来！这事干不好，以后你别想在老夫这领一枚丹药，哼哼！”
en_us: Angered, Elder Liu scowled fiercely and reprimanded, "Damn it, this is not difficult at all—this cauldron is almost done anyway! All you need to do is to apply essence force towards this spot; it'll be done once the elixir solidifies and takes shape! Hurry up and get yourself over here! If you screw this up, don't ever think of collecting even a single elixir pill from here ever again! Hmph!"

source: 柳长老捧着剩下的那枚黑色丹药，摇头晃脑的走了，江逸却愁眉苦脸的差点要哭了。
en_us: Holding the remaining black elixir pill, Elder Liu left shaking his head. However, Jiang Yi remained looking miserable and was on the verge of crying.

source: 柳长老的古怪的脾气在江家是出了名的，所以江逸等江家子弟领丹药的时候，都喜欢避开他直接找江松领取，避免得罪了这个在家族地位举足轻重的怪老头。
en_us: Elder Liu was famous in the Jiang Clan for his weird temper, thus Jiang Yi and other Jiang Clan descendants preferred to avoid him and instead find Jiang Song when they came to collect elixirs, to avoid insulting or angering this weird old man that had an influential position in the family.

source: 柳长老的死因很快查出来了，让江逸没那么内疚的是，柳长老一直就有固疾，这几年前就曾犯病三次险些死去，这几天因没日没夜的钻研才提前归西了……
en_us: Elder Liu's cause of death was quickly revealed. What left Jiang Yi feeling less guilty was that Elder Liu was already suffering from an incurable disease. Over the past few years, he had three previous experiences where he had fallen ill but managed to avoid death. However, the non-stop study into the elixir over the past few days and nights had resulted in his early demise...

source: 柳长老的脸色却一下变了，一巴掌扫去，将进来的少年直接扫出大门外，这才冷哼道：“江松，你现在可以滚了，以后这炼丹房你不用来了，混账东西，天天就知道偷懒！”
en_us: Elder Liu's look transformed instantly and sent a slap at him, sending the youth entering the room flying out of the main doors. He then snorted coldly. "Jiang Song, you can get out of my sight now! You no longer need to return to this elixir-refining room. Damned thing, all you do is laze around!"

source: 柳长老终于醒悟过来，瞥了江逸一眼，不耐烦的说道：“去另外一边的丹房内自己拿吧，爱拿多少拿多少，别来烦老夫……咦？这灵神丹内还是原先的成分啊，并没有其余的成分啊？怎么会突然变成地阶了？奇怪，奇怪……”
en_us: Elder Liu finally came to his senses. Glancing at Jiang Yi with one look, he responded impatiently, "Go to the Elixir Room on the other side and take them yourself. Take as much as you want, and don't disturb me... Eh? This Spirit Pill still contains the original ingredients, and does not contain any extra components? How did it suddenly become Earth-tier? Strange, strange..."

source: 柳长老翻脸比翻书还快，又横眉竖眼怒道：“老夫要个人，别说那什么荣管事，就算内务堂大总管江云蛇都不敢说个不字。你去和你们管事说说，他敢不同意老夫撕了他。至于不懂炼丹，这慢慢学就是了，不过你可不能学江松那个废物偷懒，否则老夫饶不了你……就这么说定了，你先回去明早来这干活，老夫得去好好研究这丹药，哈哈哈，地阶丹药……”
en_us: Elder Liu's emotions changed faster than pages of a book being turned. He scowled fiercely and said angrily, "When I want someone, to say nothing of that Chief Rong, even the Internal Affairs Chief Supervisor Jiang Yunshe doesn't dare to say a word. “You go and tell your chief; if he doesn't agree, I will rip him to shreds. As for not knowing how to refine elixirs, this you can learn slowly. However, you cannot learn to be lazy like that good-for-nothing Jiang Song, or I will never let you off... That’s settled then. You can go back first, and come back here and work tomorrow morning. I have to go carefully research this elixir. Hahaha... Earth-tier elixir..."

source: 柳长老脸上突然露出笑容，走过来几步，大手在他右肩膀上拍了一下，咧嘴笑道：“你小子不错，是老夫的福将啊！嗯……江松那个废物我不要了，暂时也没人手帮忙，你以后就在这帮老夫炼丹吧。”
en_us: Elder Liu suddenly revealed a smile on his face. He walked forward by a few steps and slapped Jiang Yi's right shoulder with his large hand. Grinning widely, he said, "You're not bad, kid! You're my lucky charm! Hmmm... That useless good-for-nothing, Jiang Song—I don't want him anymore! Since I temporarily don't have any more people to help me, why don't you stay here and help me refine elixirs from now on?"

source: 柳长老脸色一沉，吹胡子瞪眼道：“你们这些废物子弟，天天不务正业，领丹药时就贼勤快，丹药？没有！”
en_us: Elder Liu's face turned dark, blew his beard and stared at Jiang Yi as he replied, "You useless sons, all of you never ever attend to your daily duties, yet during medicine collection time you guys become so efficiently quick! Elixirs? None!"

source: 柳长老越看眼睛越亮，神神叨叨说个不停：“这色泽，这药力，像，很像！老夫炼丹一辈子，难道……终于炼出两枚地阶的丹药了？”
en_us: Elder Liu's eyes brightened the more he looked. With much liveliness, he chattered non-stop. "This hue, this medical healing power... similar, very similar! I have refined elixirs all my life... could it be... finally two Earth-tier elixirs have been refined?"

source: 柳长老这几天肯定还会继续试验炼丹，只要不注入黑色元力，他就永远炼不出地阶丹药，那么就会有很多很多的废丹……
en_us: Elder Liu would definitely continue to experiment with elixir-refining for the next few days. So long as black essence force was not injected, he would always be unable to refine Earth-level elixirs—and that would mean there would be a lot of useless elixir pills...

source: 根据这几名护卫的速度，江逸大概判断出四人的实力，内心也是一阵慌乱，如此多护卫他怎么应对？尤其是还有一人是铸鼎境三重。
en_us: From the speed of the few guards, Jiang Yi made a general judgment of four guards' strength. A wave of anxiety swept across his mind. How was he to handle that many guards? One of them was even at the third stage of the Cast Tripod Realm...

source: 桌上的懒虫秒起，上前一把握住某人的手，大义凛冽的道，“牛爸爸！我们什么时候出发？”
en_us: The slob sat up immediately. She reached for Lonemoon's arm, exclaiming over-enthusiastically, "Father Niu! When do we set off?"

source: 桌边还站着十几位婢女，她们刚一到，一个蓝衣男子，兴冲冲的迎了上来。来人长得很高，标准的模特身材，就是那张脸……有些一言难尽。一团红一团青一团紫的，特别的——色彩斑斓。
en_us: There were about a dozen servant girls standing at the tables. When they arrived, a man in blue rushed forwards eagerly to greet them . He was very tall and had the figure of a model, but… it was just that his face… there were no words that could adequately describe it. Covered in red and purple splotches, it was uniquely kaleidoscopic.

source: 槽！原来那货不单是个吃货，还TM是个路痴，话说你到底为啥想不开拜这么个坑货啊喂，“话说回来，她到底是怎么栽在那魔修手里的？”那影像又没有声音，也不知道那魔修到底说了啥？
en_us: Holy shit! So it turns out that this creature is not only a foodie, but is also freaking directionally challenged. What made you choose such a worthless creature as your teacher, I really don't know! "By the way, how did she end up in the clutches of the fiendish cultivator?" That image had provided no sound so he had no idea what the fiendish cultivator was saying.

source: 槽！居然特意隐藏了修为，没想到三人中居然有两个游仙！
en_us: Holy shit! He had actually hidden his cultivation level. Never did Lonemoon imagine that two out of the three of them were Traveling Immortals!

source: 槽！还真不需要！
en_us: Holy shit! They really didn't need it!

source: 正在专心扒饭的某人，突然听见哐当一声，一坨带血的不明生物从天而降，笔直的砸在了她的饭桌上，一只手还按在了汤碗里。
en_us: A certain someone was focused on eating her rice when a sudden banging sound was heard. A heap of blood from an unknown source fell from the sky and smashed right onto her dining table, with an arm in her soup.

source: 正在江逸沉吟时，柳长老突然抓起一枚黑色丹药吞了下去，然后就地闭目盘坐起来。只是片刻他就睁开了眼睛，一双牛眼内都是激动和狂喜：“哈哈哈，这的确是地阶下品丹药，三十年了！老夫终于炼出了地阶丹药啊，老夫终于不再是一品炼丹师了……”
en_us: Right as Jiang Yi was muttering to myself, Elder Liu suddenly grabbed one of the black elixir pills and swallowed it, before sitting cross-legged with his eyes closed. He opened his eyes almost instantly, his eyes filled with excitement and ecstasy. "Hahaha! This is indeed an Earth-tier inferior-grade elixir! It's been thirty years! I finally refined an Earth-tier elixir! I am no longer a first-rate elixir-refiner..."

source: 正在江逸迷茫之时，翊凌雪却郑重的从怀中取出一块令牌，说道：“我，翊凌雪代表翊家正式邀请你加入翊家，职位是武堂副长老，俸禄和待遇……”
en_us: While Jiang Yi was still in a daze, Yi Lingxue solemnly retrieved a command token from her chest pocket and said, "On behalf of the Yi Family, I, Yi Lingxue, formally invite you to join our family under the position of Deputy Elder of the family's martial arts training court. The remuneration will be.

source: 正想向屋内的恩人禀报，却突然感觉到一阵庞大的阴气袭来，整个人如坠冰窟，身体瞬间进入备战状态，这是妖气！好浓烈的妖气！
en_us: Just when he was about to make a report to his benefactor, he suddenly felt a great rush of Yin Qi engulfing him. He felt as if he had fallen into an ice cave. His body geared itself immediately for battle. This was demonic aura! A very strong demonic aura!

source: 正想着，前面传来叭哒一声，什么断裂的声音。易峰的滕蔓困不住体型巨大的背云兽，开始寸寸断裂，那张长满尖牙的血盆大口，更是转身就往空中咬去。
en_us: Just as she was figuring out Yi Feng's instructions, a loud snapping sound came from in front of her. Yi Feng's vine was not sturdy enough to control the great 背云兽. The vine that circled the beast's mouth began to snap as the beast opened its mouth, biting at the air behind it.

source: 正想着，沈萤却松开了脚，突然弯腰一把揪住他的领子，像是拔萝卜一样，把人给拔了出来，慢悠悠的道，“你是说实话呢，还是想再挖个坑，感受感受？”
en_us: Just as he tried to figure this out, Shen Ying removed her foot from his face and grabbed his collar. As if she was plucking radishes, she lifted him off the ground and angrily warned, "You better tell the truth or I will dig another pit in the ground with your body."

source: 正想着，突然不远处传来一声巨大的兽吼声，声音似是雷声轰鸣，直接唤醒了石化中的易峰。
en_us: Just as they were talking, they heard a loud roar from behind them. It sounded as loud as thunder. Yi Feng immediately snapped out of his stupor.

source: 正想解释，话还没说完，地面却突然一阵晃动，隐隐有剑气从四面八方涌了过来，四周的灵气开始疯狂往门外的某个方向涌出。
en_us: Just as he was about to explain, the ground suddenly shook; Sword Qi seemed to emerge from all directions, and the Spirit Qi started to head towards a certain direction out of the door.

source: 正打算不顾众人的拦阻强行闯入偏殿叫人，却已经来不及了，山下传来轰隆一声什么崩塌的声音，下一刻郁海珩带着众化神修士，已经出现在前方的广场上。
en_us: He was just about to ignore the invaders and barge into the Palace Wing to wake Shen Ying up, but it was too late. A loud sound from something collapsing came from the bottom of the hill. In the next moment, Yu Hai Heng and all the other Soul Formation cultivators appeared on the public square in front of Ying Feng.

source: 正炒着菜的羿清手里的锅铲一停，“师父，你隐世已久，不知人心险恶。”
en_us: Yi Qing suddenly stopped stir-frying and turned to Shen Ying, "Master, you have been hidden away from the world for a long time. You don't know how sinister people can be."

source: 正考虑要不要自爆金丹，跟它拼了时，那妖王抖了抖长耳，突然不急不缓的开口，语气还极为献媚？？？
en_us: While he was considering whether to self-destruct his Golden Core and fight to the very last breath, that Demon Monarch shook its long ears. Suddenly it opened its mouth unhurriedly and spoke in a tone that was extremely sycophantic?

source: 正要放弃，迎面一道雷，却刚好打在了她的胸口，有什么从里面滑了出来。她脸色顿时一变，慌忙去捡，却晚了一步，一个铃铛叮的一声掉在地上，被落下的雷光劈得四分五裂。
en_us: Just when she was about to give up, a bolt of lightning greeted her head-on but luckily it struck her chest. Something seemed to slide out of her. Her expression immediately changed and she rushed over to pick it up, but it was too late—the bell that had fallen out of her clothing dropped to the ground and was destroyed by a bolt of lightning.

source: 正要解释，刚刚还缠斗在一起的一蛟一兽终于从云层中落了下来。立于空中两端，双双都变回了人形，只是蛟龙的人形还保留着兽身的特征，一身长袍黑衣，头上还顶着一只兽角。兽角下的脸上，爬满了一条条黑色纹路，隐隐还有黑气溢出，看着有些像是当初塔里，那个叨逼叨身上的。
en_us: Sheng Ying was about to explain what she meant when the beast and wyrm that had been locked in combat finally descended from the clouds. Standing at opposite ends of the sky, both of them had changed back to their human forms; just that the wyrm still retained some characteristics of its animal body-- he was clad in a black robe and had a horn on his head. His face was covered in black stripes and his body emitted a black Q similar to that covering the windbag's body in the pagoda.

source: 此刻他可不敢用真名，他很清楚这丹药既然惊动了姬家的小姐，肯定是对方察觉了黑色元力的特殊，匹夫无罪，怀璧其罪的道理他还是懂的。
en_us: He did not dare to use his real name at that moment. He was well aware that, being the case that the elixir had startled the young mistress of the Ji Family, the other party must have found out the special abilities of the black essence force. A man's wealth is his own ruin, for it encourages greed in others - he certainly understood this concept.

source: 此刻在武殿内闭关的公子小姐最少有二三十人，每天这群人中大半部分都会来这打上一两场，所以武殿内的陪练才会如此短缺。当然，根据江逸的猜测武殿内的陪练应该不止这么多，估计很多陪练都是被人打得重伤回去疗伤了，这群公子小姐可从不把陪练当人看的，出手没个轻重……
en_us: At present there were at least twenty or thirty young masters and mistresses in seclusion within the Martial Arts Hall. Every single day, more than half of this group of people would go up there to fight one or two matches. That was why there was such a severe shortage of sparring partners in the Martial Arts Hall. Of course, according to Jiang Yi's estimate, there should not be only so many sparring partners in the Martial Arts Hall. He guessed that many of the sparring partners had been beaten up severely and had left to recuperate from their injuries. This bunch of young masters and mistresses had after all never treated their sparring partners as fellow human beings, their attacks always being very heavy-handed and full of force...

source: 此刻外面剩下那个护卫本想跟着冲进来，却看到一道身影被踹飞出来，顿时吓得头一缩不敢冲了。如此短的时间内，江逸连续击伤两人，其中一人还是他们中最强的铸鼎境三重武者？试问这护卫怎么还敢冲进来主动挨打？
en_us: At this moment, the last remaining guard outside had thought of following his comrade and rushing in. However, seeing a figure be sent flying out by a single kick left him instantly shocked to the point that he withdrew his head and refused to rush in. In such a short period of time, Jiang Yi was able to consecutively attack and injure two people—and was one of the two not the strongest amongst them, a warrior at the third stage of the Cast Tripod Realm? How could this guard possibly dare to rush in now and end up getting thrashed?

source: 此刻江如虎来了，但他内心却没有一丝兴奋，反而满脸的苦涩，暗道自己太大意了。
en_us: At that moment, Jiang Ruhu had indeed arrived, but he did not have a shred of excitement deep in his heart. Rather, his face filled with bitterness and agony. He muttered to himself that he was too careless.

source: 此时他手里明明没有了任何法器，周身却照样出现了万千灵剑，剑意比之前更加强大百倍，青亦的红莲业火也再无法动他分毫，明明他已经把修为压制在元婴，青亦也还是游仙，两人立场却仿佛对调了过来，成了羿清对青亦单方面的辗压。
en_us: Yi Qing was not holding any weapon in his hand, yet tens of thousands of spirit swords appeared around him. His sword intent was hundreds of times stronger than before; Qing Yi's Red Lotus Karmic Fire would not be able to do anything to him anymore. He had suppressed his cultivation level so that he remained at the Nascent Soul stage. Qing Yi was still a Traveling Immortal, yet despite that, the two seemed to have swapped positions. Yi Qing now clearly had the upper hand against Qing Yi.

source: 此时漆黑的仙宫内，却由于外人的闯入，瞬间亮了起来，道道仙音响起，仙气大盛五彩霞光充斥着整个大殿。仿佛远古天音般空灵之声，顿时在殿内响起。
en_us: At this moment, the pitch black Immortal Pavilion lit up at the intrusion. Otherworldly tunes began to sound as Immortal Qi and colourful lights filled the entire hall. What sounded like ancient sounds coming from Ethereal Spirits suddenly rang out.

source: 此时百里之外。
en_us: At this time, 50 kilometers away.

source: 此时的江逸已经完全没了睡意，他朝窗外望了眼，然后点燃油灯，强忍住疼痛把全身上下二三十处伤口上了些药，然后盘腿坐回到床上。
en_us: At that moment, Jiang Yi had lost all his drowsiness. He quickly looked out the window, before lighting his candle. After enduring the bodily agony from applying medicine on some twenty or thirty wounds throughout his body, he sat cross-legged on his bed.

source: 此时的沈萤。
en_us: At that time, Shen Ying...

source: 此时那枯井中正飞出一个红色影子，那身形十分高大，赤色的皮毛，红得似是染了血，九条火红的尾巴在空中肆意摇摆。
en_us: At this moment, a red figure flew out of the dry well. It was very tall, with fur so red that it seemed like it had been dyed in blood, and it was waving its nine flaming red tails wilfully in the air.

source: 此时魔界迎来了史上第一次，也是唯一一次种族灭绝危机。只见一道青色的身影，划破魔界常年昏暗的天空，所经之地，势不可挡，万魔伏首。甚至还没魔看清他长什么样，就已经归于尘土，那道身影，自魔界之门开始，一路横扫过整个万魔大陆。自东向西，然后转南，再转北，再去南，再去北……南北……
en_us: Currenly, the Demon Realm was 'greeted' with the first and only extinction crisis. A blueish-green figure sliced through the ever dim and stale sky of the Demon Realm. Through the places she has passed, no one was capable of stopping her. Demons were not even given enough time to register what they were seeing before becoming corpses that laid along the way. Starting from the Door of Demon Realm,the figure swept down the entire Demon ground. From the East to the West, then turned to the South, then North, South, North...North, South...

source: 此时，迎缘峰。
en_us: At the same time, on Yingyuan Peak.

source: 此阵绝不可能是狐妖布下的，很有可能它本身就在这里，狐妖发现了，所以故意把血祭大阵的阵眼布在这上里，而他们刚刚攻击时的灵气，刚好重新激活了这个阵法。
en_us: This array could not have been set up by the fox demon; it was very likely that it had been there all along. The fox demon had discovered it, so it had deliberately set up the blood sacrifice array there, and the Spirit Qi emitted during their attack on the fox demon had happened to activate the array.

source: 武堂长老面色更加阴沉了，一只大手元力环绕，大步朝江逸走去，阴冷的声音响彻整个演武殿：“你这畜生伤了人还如此张狂？莫非你以为本座真的不敢杀人？”
en_us: The Martial Court Elder's expression was now even more severe. Circulating the essence force around one of his hands, he took a big step towards Jiang Yi and spoke in a gloomy and cold voice that echoed throughout the entire Martial Arts Demonstration Hall, "How dare you this little bastard be this presumptuous even after injuring all these people? Do you really think I dare not kill you?"

source: 武技按照掌握程度分为入门，精通，大成三个阶段，这翊小姐的暴雨拳三年都没有大成，现在和江逸对战一场就直接大成了？
en_us: The mastery of martial arts techniques were divided into three different levels - namely the Entry, Proficient and Phenomenal stages. How could it be that this Young Mistress Yi's skills in the Thunderstorm Fist technique had not reached the Phenomenal stage in three years worth of training, yet in one practice match against Jiang Yi, she immediately attained "Phenomenal" success?
